Repository: deloog/jinlin
Catalog: lib/l10n/app_localizations_*.arb
Languages: de, fr, ja, ko, zh

# reminderAppTitle
source: Reminder App
de: Erinnerungs-App
fr: Application de rappel
ja: リマインダーアプリ
ko: 리마인더 앱
zh: 鲸灵提醒

# appTitle
source: CetaMind Reminder
de: CetaMind Erinnerung
fr: Rappel CetaMind
ja: 鯨霊リマインダー
ko: 고래영 리마인더
zh: 鲸灵提醒

# someOtherKey
source: Some other text
de: Anderer Text
fr: Autre texte
ja: その他のテキスト
ko: 다른 텍스트
zh: 一些其他的文本

# settingsTooltip
source: Settings
de: Einstellungen
fr: Paramètres
ja: 設定
ko: 설정
zh: 设置

# addReminderTooltip
source: Add Reminder
de: Erinnerung hinzufügen
fr: Ajouter un rappel
ja: リマインダーを追加
ko: 리마인더 추가
zh: 添加提醒

# noReminders
source: No reminders yet, try adding one!
de: Noch keine Erinnerungen, fügen Sie eine hinzu!
fr: Pas encore de rappels, essayez d'en ajouter un !
ja: リマインダーはまだありません。追加してみましょう！
ko: 아직 리마인더가 없습니다. 하나 추가해 보세요!
zh: 没有提醒事项，尝试添加一个吧！

# deleteTooltip
source: Delete Reminder
de: Erinnerung löschen
fr: Supprimer le rappel
ja: リマインダーを削除
ko: 리마인더 삭제
zh: 删除提醒

source: Add Reminder
de: Erinnerung hinzufügen
fr: Ajouter un rappel
ja: リマインダーを追加
ko: 리마인더 추가
zh: 添加纪念日

# anniversaryName
source: Title
de: Titel
fr: Titre
ja: タイトル
ko: 제목
zh: 纪念日名称

source: Date
de: Datum
ja: 日付
ko: 날짜
zh: 日期

source: Time
de: Zeit
fr: Heure
ja: 時間
ko: 시간
zh: 时间

# lunarCalendarOnlyChina
source: Lunar Calendar
de: Mondkalender
fr: Calendrier lunaire
ja: 旧暦
ko: 음력
zh: 农历 (仅在中国区使用)

source: Save
de: Speichern
fr: Enregistrer
ja: 保存
ko: 저장
zh: 保存

source: Reminders
de: Erinnerungen
fr: Rappels
ja: リマインダー
ko: 리마인더
zh: 纪念日提醒

# noRemindersAdded
source: No reminders added yet.
de: Noch keine Erinnerungen hinzugefügt.
fr: Aucun rappel ajouté pour l'instant.
ja: まだリマインダーが追加されていません。
ko: 아직 추가된 리마인더가 없습니다.
zh: 还没有添加任何纪念日

source: Speech recognition failed
zh: 语音识别失败，请稍后重试。

source: Unable to understand input
zh: 无法理解您的输入。

source: Manual Input
de: Manuelle Eingabe
fr: Saisie manuelle
ja: 手動入力
ko: 수동 입력
zh: 手动填写

source: Voice Input
de: Spracheingabe
fr: Entrée vocale
ja: 音声入力
ko: 음성 입력
zh: 语音输入

source: Natural Language Input
de: Natürliche Spracheingabe
fr: Entrée en langage naturel
ja: 自然言語入力
ko: 자연어 입력
zh: 自然语言输入

source: Enter reminder details
de: Erinnerungsdetails eingeben
fr: Saisir les détails du rappel
ja: リマインダーの詳細を入力
ko: 리마인더 세부 정보 입력
zh: 输入提醒详情

source: Delete Reminder
de: Erinnerung löschen
fr: Supprimer le rappel
ja: リマインダーを削除
ko: 리마인더 삭제
zh: 删除提醒

# confirmDeletionTitle
source: Confirm Deletion
de: Löschen bestätigen
fr: Confirmer la suppression
ja: 削除の確認
ko: 삭제 확인
zh: 确认删除

# confirmDeletionContent
source: Are you sure you want to delete "{reminderTitle}"?
de: Möchten Sie "{reminderTitle}" wirklich löschen?
fr: Êtes-vous sûr de vouloir supprimer "{reminderTitle}" ?
ja: 「{reminderTitle}」を削除してもよろしいですか？
ko: "{reminderTitle}"을(를) 삭제하시겠습니까?
zh: 确定要删除 "{reminderTitle}" 吗？

# addReminderTitle
source: Add New Reminder
de: Neue Erinnerung hinzufügen
fr: Ajouter un nouveau rappel
ja: 新しいリマインダーを追加
ko: 새 리마인더 추가
zh: 添加新提醒

# editReminderTitle
source: Edit Reminder
de: Erinnerung bearbeiten
fr: Modifier le rappel
ja: リマインダーを編集
ko: 리마인더 편집
zh: 编辑提醒

# reminderContentLabel
source: Reminder Content or Title
de: Erinnerungsinhalt oder Titel
fr: Contenu ou titre du rappel
ja: リマインダーの内容またはタイトル
ko: 리마인더 내용 또는 제목
zh: 输入提醒内容或标题

# reminderContentHint
source: e.g., Meeting with Mr. Zhang tomorrow 3pm
de: z.B. Besprechung mit Herrn Zhang morgen um 15 Uhr
fr: ex. : Réunion avec M. Zhang demain à 15h
ja: 例：明日午後3時に張さんとの会議
ko: 예: 내일 오후 3시에 장씨와 회의
zh: 例如：明天下午3点和张总开会

# smartInputTooltip
source: Smart identify title and date
de: Titel und Datum intelligent erkennen
fr: Identification intelligente du titre et de la date
ja: タイトルと日付をスマート識別
ko: 제목과 날짜 스마트 식별
zh: 智能识别标题和日期

# micStopTooltip
source: Stop
de: Stopp
fr: Arrêter
ja: 停止
ko: 중지
zh: 停止

# micListenTooltip
source: Voice Input
de: Spracheingabe
fr: Entrée vocale
ja: 音声入力
ko: 음성 입력
zh: 语音输入

# descriptionLabel
source: Reminder Description (Optional)
de: Erinnerungsbeschreibung (Optional)
fr: Description du rappel (Optionnel)
ja: リマインダーの説明（オプション）
ko: 리마인더 설명 (선택사항)
zh: 提醒描述（可选）

# descriptionHint
source: Details, can be auto-generated by AI
de: Details, kann automatisch durch KI generiert werden
fr: Détails, peut être généré automatiquement par l'IA
ja: 詳細、AIによる自動生成が可能
ko: 세부 정보, AI로 자동 생성 가능
zh: 详细内容，可由 AI 自动生成

# addDateTimeButton
source: Add Date & Time
de: Datum & Zeit hinzufügen
fr: Ajouter date et heure
ja: 日付と時間を追加
ko: 날짜 및 시간 추가
zh: 添加日期和时间

# clearDateTimeTooltip
source: Clear Date
de: Datum löschen
fr: Effacer la date
ja: 日付をクリア
ko: 날짜 지우기
zh: 清除日期

# generateDescriptionButton
source: AI Generate Description
de: KI-Beschreibung generieren
fr: Générer une description par IA
ja: AI説明生成
ko: AI 설명 생성
zh: AI 辅助生成描述

# generatingButton
source: Generating...
de: Generiere...
fr: Génération en cours...
ja: 生成中...
ko: 생성 중...
zh: 生成中...

# saveReminderButton
source: Save Reminder
de: Erinnerung speichern
fr: Enregistrer le rappel
ja: リマインダーを保存
ko: 리마인더 저장
zh: 保存提醒

# updateReminderButton
source: Update Reminder
de: Erinnerung aktualisieren
fr: Mettre à jour le rappel
ja: リマインダーを更新
ko: 리마인더 업데이트
zh: 更新提醒

# listeningStatus
source: Listening...
de: Höre zu...
fr: Écoute en cours...
ja: 聞いています...
ko: 듣는 중...
zh: 正在聆听...

# speechInitStatus
source: Preparing speech function...
de: Sprachfunktion wird vorbereitet...
fr: Préparation de la fonction vocale...
ja: 音声機能を準備中...
ko: 음성 기능 준비 중...
zh: 正在准备语音功能...

# inputTitleFirstInfo
source: Please enter content in the title box first
de: Bitte geben Sie zuerst einen Titel ein
fr: Veuillez d'abord saisir un titre
ja: まずタイトルを入力してください
ko: 먼저 제목을 입력해 주세요
zh: 请先在标题框输入内容

# smartInputFailedError
source: Smart identification failed: {error}
de: Intelligente Erkennung fehlgeschlagen: {error}
fr: Échec de la reconnaissance intelligente : {error}
ja: スマート認識に失敗しました: {error}
ko: 스마트 인식 실패: {error}
zh: 智能识别失败: {error}

# dateParseFailedInfo
source: Title identified, but date format unrecognized
zh: 已识别标题，但日期格式无法识别

# titleEmptyError
source: Reminder title cannot be empty
zh: 提醒标题不能为空

# conflictDialogTitle
source: Time Conflict
zh: 时间冲突

# conflictDialogContent
source: The time you set conflicts with reminder "{title}". Save anyway?
zh: 你设置的时间与提醒 "{title}" 存在冲突，确定要继续保存吗？

# inputTitleForDesc
source: Please enter a title first to generate description
de: Bitte geben Sie zuerst einen Titel ein, um eine Beschreibung zu generieren
fr: Veuillez d'abord saisir un titre pour générer une description
ja: 説明を生成するには、まずタイトルを入力してください
ko: 설명을 생성하려면 먼저 제목을 입력하세요
zh: 请先输入标题才能生成描述

# descGeneratedSuccess
source: Description generated successfully
de: Beschreibung erfolgreich generiert
fr: Description générée avec succès
ja: 説明が生成されました
ko: 설명이 생성되었습니다
zh: 描述已生成

# descGeneratedError
source: Failed to generate description: {error}
de: Beschreibungsgenerierung fehlgeschlagen: {error}
fr: Échec de la génération de la description : {error}
ja: 説明の生成に失敗しました: {error}
ko: 설명 생성 실패: {error}
zh: 生成描述失败: {error}

# reminderDetailTitle
source: Reminder Details
de: Erinnerungsdetails
fr: Détails du rappel
ja: リマインダーの詳細
ko: 리마인더 상세 정보
zh: 提醒详情

# editButtonTooltip
source: Edit
de: Bearbeiten
fr: Modifier
ja: 編集
ko: 편집
zh: 编辑

# deleteButtonTooltip
source: Delete
de: Löschen
fr: Supprimer
ja: 削除
ko: 삭제
zh: 删除

# deleteConfirmationTitle
source: Confirm Deletion
de: Löschbestätigung
fr: Confirmation de suppression
ja: 削除の確認
ko: 삭제 확인
zh: 确认删除

# deleteConfirmationContent
source: Are you sure you want to delete this reminder? This action cannot be undone.
de: Möchten Sie diese Erinnerung löschen? Diese Aktion kann nicht rückgängig gemacht werden.
fr: Voulez-vous supprimer ce rappel ? Cette action est irréversible.
ja: このリマインダーを削除してもよろしいですか？この操作は元に戻せません。
ko: 이 리마인더를 삭제하시겠습니까? 이 작업은 취소할 수 없습니다.
zh: 确定要删除这个提醒事项吗？此操作无法撤销。

source: Date not set
de: Datum nicht festgelegt
fr: Date non définie
ja: 日付未設定
ko: 날짜 미설정
zh: 未设置日期

# descriptionSectionTitle
source: Description:
de: Beschreibung:
ja: 説明:
ko: 설명:
zh: 描述:

# aiAssistantSectionTitle
source: AI Assistant
de: KI-Assistent
fr: Assistant IA
ja: AIアシスタント
ko: AI 어시스턴트
zh: AI 助手

# smartTipsSectionTitle
source: Smart Tips
de: Intelligente Tipps
fr: Conseils intelligents
ja: スマートヒント
ko: 스마트 팁
zh: 智能提示

source: No description
de: Keine Beschreibung
fr: Pas de description
ja: 説明なし
ko: 설명 없음
zh: 无描述

# aiBlessingsPlaceholder
source: [AI-generated blessings will appear here...]
de: [Von KI generierte Glückwünsche erscheinen hier...]
fr: [Les vœux générés par l'IA apparaîtront ici...]
ja: [AIが生成したメッセージがここに表示されます...]
ko: [AI가 생성한 축하 메시지가 여기에 표시됩니다...]
zh: [AI 生成的祝福语将显示在这里...]

# aiGiftsPlaceholder
source: [AI-recommended gifts will appear here...]
de: [Von KI empfohlene Geschenke erscheinen hier...]
fr: [Les suggestions de cadeaux de l'IA apparaîtront ici...]
ja: [AIがおすすめするギフトがここに表示されます...]
ko: [AI가 추천하는 선물이 여기에 표시됩니다...]
zh: [AI 推荐的礼物建议将显示在这里...]

# aiTipsPlaceholder
source: [Tips based on event characteristics will appear here...]
de: [Tipps basierend auf den Ereignismerkmalen erscheinen hier...]
fr: [Des conseils basés sur les caractéristiques de l'événement apparaîtront ici...]
ja: [イベントの特性に基づくヒントがここに表示されます...]
ko: [이벤트 특성에 따른 팁이 여기에 표시됩니다...]
zh: [根据事件特点提供的提示将显示在这里...]

# swapBlessingsButton
source: Swap 3
de: 3 austauschen
fr: Échanger 3
ja: 3つ交換
ko: 3개 교체
zh: 换三条

# aiBlessingSectionTitle
source: Blessings:
zh: 祝福语:

# aiGiftSectionTitle
source: Gift Ideas:
zh: 礼物推荐:

# cannotChangeLanguageError
source: Failed to change language, please try again
de: Sprachänderung fehlgeschlagen, bitte versuchen Sie es erneut
fr: Échec du changement de langue, veuillez réessayer
ja: 言語の変更に失敗しました。もう一度お試しください
ko: 언어 변경 실패, 다시 시도해 주세요
zh: 无法更改语言，请重试

# saveButton
source: Save
de: Speichern
fr: Enregistrer
ja: 保存
ko: 저장
zh: 保存

# settingsTitle
source: Settings
zh: 设置

# settingsSectionPersonal
source: Personal
zh: 个人

# settingsNicknameTitle
source: Nickname
zh: 昵称

# settingsNicknameSubtitle
source: Edit your nickname
zh: 编辑您的昵称

# settingsAvatarTitle
source: Avatar Management
zh: 头像管理

# settingsAvatarSubtitle
source: Manage your and friends' avatars
zh: 管理自己和亲友的头像

# settingsSectionFunction
source: Function
zh: 功能

# settingsLanguageTitle
source: Language
zh: 语言选择

# settingsLanguageSubtitle
source: Current: {locale}
zh: 当前: {locale}

# settingsNotificationTitle
source: Notification Settings
zh: 通知设置

# settingsNotificationSubtitle
source: Customize reminders, sounds, etc.
zh: 自定义提醒方式、声音等

# settingsSectionData
source: Data & Content
zh: 数据与内容

# settingsAddFestivalTitle
source: Add Festivals
zh: 添加节日

# settingsAddFestivalSubtitle
source: Add local or personalized festivals
zh: 添加地方性或个性化节日

# settingsImportExportTitle
source: Import/Export Data
zh: 导入/导出数据

# settingsImportExportSubtitle
source: Import from calendar or backup data
zh: 从日历导入或备份数据

# settingsSectionAbout
source: About
zh: 关于

# settingsAboutAppTitle
source: About CetaMind Reminder
zh: 关于鲸灵提醒

# settingsPrivacyPolicyTitle
source: Privacy Policy
zh: 隐私政策

# settingsFeatureNotImplemented
source: {featureName} feature to be implemented
zh: {featureName} 功能待实现

# cancelButton
source: Cancel
de: Abbrechen
fr: Annuler
ja: キャンセル
ko: 취소
zh: 取消

# saveAnywayButton
source: Save Anyway
de: Trotzdem speichern
fr: Enregistrer quand même
ja: とにかく保存
ko: 그래도 저장
zh: 仍然保存

source: Cancel
de: Abbrechen
fr: Annuler
ja: キャンセル
ko: 취소
zh: 取消

source: Delete
de: Löschen
fr: Supprimer
ja: 削除
ko: 삭제
zh: 删除

source: Select
de: Auswählen
fr: Sélectionner
ja: 選択
ko: 선택
zh: 选择

# naturalInputHint
source: e.g., Meeting tomorrow 3 PM
de: z.B. Besprechung morgen um 15 Uhr
fr: ex. : réunion demain à 15h
ja: 例：明日午後3時に会議
ko: 예: 내일 오후 3시 회의
zh: 例如：明天下午3点开会

# pleaseEnterTitle
source: Please enter a valid title
de: Bitte geben Sie einen gültigen Titel ein
fr: Veuillez saisir un titre valide
ja: 有効なタイトルを入力してください
ko: 유효한 제목을 입력하세요
zh: 请输入有效标题

# detectedDateTime
source: Detected
de: Erkanntes Datum
fr: Date détectée
ja: 検出された日時
ko: 감지된 날짜
zh: 识别结果

source: Lunar
fr: Lunaire
ja: 旧暦
ko: 음력
zh: 农历

# recordingInProgress
source: Recording...
de: Aufnahme läuft...
fr: Enregistrement en cours...
ja: 録音中...
ko: 녹음 중...
zh: 正在录音...

source: Processing audio...
de: Audio wird verarbeitet...
fr: Traitement audio en cours...
ja: 音声を処理中...
ko: 오디오 처리 중...
zh: 正在处理...

# recordingStartFailed
source: Failed to start recording.
de: Aufnahmestart fehlgeschlagen.
fr: Échec du démarrage de l'enregistrement.
ja: 録音の開始に失敗しました。
ko: 녹음 시작 실패.
zh: 启动录音失败。

# recordingStopFailed
source: Failed to stop recording.
de: Aufnahmestopp fehlgeschlagen.
fr: Échec de l'arrêt de l'enregistrement.
ja: 録音の停止に失敗しました。
ko: 녹음 중지 실패.
zh: 停止录音失败。

source: No recording permission
de: Keine Aufnahmeberechtigung
fr: Pas d'autorisation d'enregistrement
ja: 録音権限がありません
ko: 녹음 권한 없음
zh: 没有录音权限

source: Error checking permission
de: Fehler beim Überprüfen der Berechtigung
fr: Erreur lors de la vérification des autorisations
ja: 権限の確認中にエラーが発生しました
ko: 권한 확인 오류
zh: 检查权限时出错

source: Start Recording
zh: 开始录音

source: Stop Recording
zh: 停止录音

source: Process Text
zh: 处理文本

source: Switch to Manual Input
zh: 切换到手动输入

# switchToNaturalInput
source: Switch to Natural Language Input
zh: 切换到自然语言输入

source: Error processing input.
zh: 处理输入时出错。

source: Please wait...
zh: 请稍候...

# invalidDateTime
source: Invalid date or time selected
zh: 选择了无效的日期或时间

source: Clear Title
zh: 清除标题

source: Event Date
zh: 事件日期

source: Reminder Time
zh: 提醒时间

# remainingDays
source: {days} days left
zh: 还剩 {days} 天

# detectedEventsTitle
source: Detected Events
de: Erkannte Ereignisse
fr: Événements détectés
ja: 検出されたイベント
ko: 감지된 이벤트
zh: 识别出的事件

# noTitlePlaceholder
source: (No Title)
de: (Kein Titel)
fr: (Pas de titre)
ja: (タイトルなし)
ko: (제목 없음)
zh: （无标题）

# noDatePlaceholder
source: (No Date)
de: (Kein Datum)
fr: (Pas de date)
ja: (日付なし)
ko: (날짜 없음)
zh: （无日期）

# notesTitle
source: ðŸ“Œ Notes:
de: 📌 Notizen:
fr: 📌 Notes :
ja: 📌 メモ:
ko: 📌 메모:
zh: 📌 注意事项：

# selectEventsToSave
source: Please select events to save
de: Wählen Sie zu speichernde Ereignisse aus
fr: Sélectionnez les événements à enregistrer
ja: 保存するイベントを選択してください
ko: 저장할 이벤트를 선택하세요
zh: 请选择要保存的事件

# saveSelectedEvents
source: Save {count} selected items
de: {count} ausgewählte Elemente speichern
fr: Enregistrer {count} éléments sélectionnés
ja: 選択した{count}項目を保存
ko: 선택한 {count}개 항목 저장
zh: 保存选中的 {count} 项

# noValidEventsSelected
source: No valid events selected to save.
de: Keine gültigen Ereignisse zum Speichern ausgewählt.
fr: Aucun événement valide sélectionné pour l'enregistrement.
ja: 保存する有効なイベントが選択されていません。
ko: 저장할 유효한 이벤트가 선택되지 않았습니다.
zh: 没有选中有效的事件来保存。

source: Analyzing text...
de: Text wird analysiert...
fr: Analyse du texte...
ja: テキストを分析中...
ko: 텍스트 분석 중...
zh: 正在分析文本...

# multipleEventsDetected
source: {count} events detected, listed below. Please select to process.
de: {count} Ereignisse erkannt, unten aufgelistet. Wählen Sie aus, welche verarbeitet werden sollen.
fr: {count} événements détectés, listés ci-dessous. Sélectionnez ceux à traiter.
ja: {count}件のイベントが検出されました。以下に一覧表示されています。処理するものを選択してください。
ko: {count}개의 이벤트가 감지되었습니다. 아래에 나열되어 있습니다. 처리할 항목을 선택하세요.
zh: 识别到 {count} 个事件，已在下方列出。请选择处理。

# singleEventDetected
source: 1 event detected, listed below.
de: 1 Ereignis erkannt, unten aufgelistet.
fr: 1 événement détecté, listé ci-dessous.
ja: 1件のイベントが検出されました。以下に一覧表示されています。
ko: 1개의 이벤트가 감지되었습니다. 아래에 나열되어 있습니다.
zh: 识别到 1 个事件，已在下方列出。

# noValidEventsDetected
source: No valid reminder events detected.
de: Keine gültigen Erinnerungsereignisse erkannt.
fr: Aucun événement de rappel valide détecté.
ja: 有効なリマインダーイベントが検出されませんでした。
ko: 유효한 리마인더 이벤트가 감지되지 않았습니다.
zh: 未能识别出有效的提醒事件。

# emptyStateMessage
source: No reminders or holidays yet, try adding one!
de: Noch keine Erinnerungen oder Feiertage, fügen Sie eine hinzu!
fr: Pas encore de rappels ou de jours fériés, essayez d'en ajouter un !
ja: まだリマインダーや祝日がありません。 追加してみましょう！
ko: 아직 리마인더나 공휴일이 없습니다. 하나 추가해 보세요!
zh: 还没有任何提醒或节日呢， 快去添加一个吧！

# closeButton
source: Close
de: Schließen
fr: Fermer
ja: 閉じる
ko: 닫기
zh: 关闭

source: Today
de: Heute
fr: Aujourd'hui
ja: 今日
ko: 오늘
zh: 今天

# loadingRemindersError
source: Failed to load reminders
de: Fehler beim Laden der Erinnerungen
fr: Échec du chargement des rappels
ja: リマインダーの読み込みに失敗しました
ko: 리마인더 로드 실패
zh: 加载提醒事项失败

# cannotOpenReminderDetails
source: Cannot open reminder details, data may not be synced, please refresh and try again
de: Erinnerungsdetails können nicht geöffnet werden, Daten sind möglicherweise nicht synchronisiert, bitte aktualisieren und erneut versuchen
fr: Impossible d'ouvrir les détails du rappel, les données peuvent ne pas être synchronisées, veuillez actualiser et réessayer
ja: リマインダーの詳細を開けません。データが同期されていない可能性があります。更新して再試行してください
ko: 리마인더 세부 정보를 열 수 없습니다. 데이터가 동기화되지 않았을 수 있습니다. 새로고침 후 다시 시도하세요
zh: 无法打开提醒详情，数据可能未同步，请刷新重试

# deleteFailed
source: Delete failed, please try again
de: Löschen fehlgeschlagen, bitte versuchen Sie es erneut
fr: Échec de la suppression, veuillez réessayer
ja: 削除に失敗しました。もう一度お試しください
ko: 삭제 실패, 다시 시도하세요
zh: 删除失败，请重试

# holiday_NewYearDay
source: New Year's Day
de: Neujahr
fr: Jour de l'An
ja: 元日
ko: 신정
zh: 元旦

# holiday_ValentinesDay
source: Valentine's Day
de: Valentinstag
fr: Saint-Valentin
ja: バレンタインデー
ko: 발렌타인 데이
zh: 情人节

# holiday_EarthDay
source: Earth Day
de: Tag der Erde
fr: Jour de la Terre
ja: アースデー
ko: 지구의 날
zh: 地球日

# holiday_LabourDay
source: Labour Day
de: Tag der Arbeit
fr: Fête du Travail
ja: 労働の日
ko: 노동절
zh: 劳动节

# holiday_ChildrensDay
source: Children's Day
de: Kindertag
fr: Journée des enfants
ja: こどもの日
ko: 어린이날
zh: 儿童节

# holiday_WorldEnvironmentDay
source: World Environment Day
de: Weltumwelttag
fr: Journée mondiale de l'environnement
ja: 世界環境デー
ko: 세계 환경의 날
zh: 世界环境日

# holiday_UNDay
source: United Nations Day
de: Tag der Vereinten Nationen
fr: Journée des Nations Unies
ja: 国連デー
ko: 유엔의 날
zh: 联合国日

# holiday_HumanRightsDay
source: Human Rights Day
de: Tag der Menschenrechte
fr: Journée des droits de l'homme
ja: 世界人権デー
ko: 세계 인권의 날
zh: 世界人权日

# holiday_Easter
source: Easter
de: Ostern
fr: Pâques
ja: イースター
ko: 부활절
zh: 复活节

# holiday_Halloween
source: Halloween
ja: ハロウィン
ko: 할로윈
zh: 万圣节

# holiday_Thanksgiving
source: Thanksgiving
de: Erntedankfest
fr: Action de grâce
ja: 感謝祭
ko: 추수감사절
zh: 感恩节

# holiday_Christmas
source: Christmas
de: Weihnachten
fr: Noël
ja: クリスマス
ko: 크리스마스
zh: 圣诞节

# holiday_NewYearsEve
source: New Year's Eve
de: Silvester
fr: Réveillon du Nouvel An
ja: 大晦日
ko: 섣달 그믐
zh: 除夕

# holiday_MothersDay
source: Mother's Day
de: Muttertag
fr: Fête des Mères
ja: 母の日
ko: 어머니의 날
zh: 母亲节

# holiday_FathersDay
source: Father's Day
de: Vatertag
fr: Fête des Pères
ja: 父の日
ko: 아버지의 날
zh: 父亲节

# aboutHoliday
source: About this Holiday
de: Über diesen Feiertag
fr: À propos de ce jour férié
ja: この祝日について
ko: 이 공휴일에 대하여
zh: 关于这个节日

source: Holiday Customs
de: Feiertagsbräuche
fr: Coutumes du jour férié
ja: 祝日の習慣
ko: 공휴일 풍습
zh: 节日习俗

source: Statutory Holiday
de: Gesetzlicher Feiertag
fr: Jour férié légal
ja: 法定祝日
ko: 법정 공휴일
zh: 法定节日

source: Traditional Holiday
de: Traditioneller Feiertag
fr: Fête traditionnelle
ja: 伝統的な祝日
ko: 전통 공휴일
zh: 传统节日

source: Memorial Day
de: Gedenktag
fr: Jour commémoratif
ja: 記念日
ko: 기념일
zh: 纪念日

source: Other Holiday
de: Anderer Feiertag
fr: Autre jour férié
ja: その他の祝日
ko: 기타 공휴일
zh: 其他节日

source: Holiday
de: Feiertag
fr: Jour férié
ja: 祝日
ko: 공휴일
zh: 节日

source: Tomorrow
de: Morgen
fr: Demain
ja: 明日
ko: 내일
zh: 明天

# daysRemaining
source: {days} days left
de: Noch {days} Tage
fr: {days} jours restants
ja: あと{days}日
ko: {days}일 남음
zh: 还有 {days} 天

# daysAgo
source: {days} days ago
zh: {days} 天前

# genericCustom1
source: Gathering with family and friends
de: Treffen mit Familie und Freunden
fr: Réunions avec la famille et les amis
ja: 家族や友人との集まり
ko: 가족 및 친구들과의 모임
zh: 与家人和朋友团聚

# genericCustom2
source: Preparing special foods and decorations
de: Vorbereitung spezieller Speisen und Dekorationen
fr: Préparation de nourriture et de décorations spéciales
ja: 特別な食べ物や装飾の準備
ko: 특별한 음식과 장식 준비
zh: 准备特色食品和装饰

# genericCustom3
source: Exchanging gifts or greetings
de: Austausch von Geschenken und Grüßen
fr: Échange de cadeaux et de salutations
ja: 贈り物や挨拶の交換
ko: 선물이나 인사 교환
zh: 交换礼物或祝福

# holidayTaboos
source: Things to Avoid
de: Zu vermeidende Dinge
fr: Choses à éviter
ja: 避けるべきこと
ko: 피해야 할 것들
zh: 节日禁忌

# genericTaboo1
source: Avoid discussing negative topics during the celebration
de: Negative Themen während der Feierlichkeiten vermeiden
fr: Éviter les sujets négatifs pendant les célébrations
ja: お祝いの間にネガティブな話題を避ける
ko: 축하 행사 중 부정적인 주제 논의 피하기
zh: 避免在庆祝活动中讨论负面话题

# genericTaboo2
source: Avoid certain foods or activities that may be considered inappropriate
de: Bestimmte Speisen oder Aktivitäten vermeiden, die als unangemessen gelten könnten
fr: Éviter certains aliments ou activités considérés comme inappropriés
ja: 不適切と考えられる特定の食べ物や活動を避ける
ko: 부적절하다고 여겨질 수 있는 특정 음식이나 활동 피하기
zh: 避免某些可能被认为不适当的食物或活动

# genericTaboo3
source: Respect local customs and traditions
de: Lokale Bräuche und Traditionen respektieren
fr: Respecter les coutumes et traditions locales
ja: 地元の習慣や伝統を尊重する
ko: 현지 관습과 전통 존중하기
zh: 尊重当地习俗和传统

# holidayFilterTitle
source: Filter Holidays
de: Feiertage filtern
fr: Filtrer les jours fériés
ja: 祝日をフィルター
ko: 공휴일 필터
zh: 筛选节日

# holidayFilterDescription
source: Select which types of holidays to display:
de: Wählen Sie die anzuzeigenden Feiertagstypen:
fr: Sélectionnez les types de jours fériés à afficher :
ja: 表示する祝日の種類を選択してください：
ko: 표시할 공휴일 유형 선택:
zh: 选择要显示的节日类型：

source: Solar Term
de: Solartermine
fr: Termes solaires
ja: 二十四節気
ko: 절기
zh: 节气

# applyButton
source: Apply
de: Anwenden
fr: Appliquer
ja: 適用
ko: 적용
zh: 应用

# filterHolidays
source: Filter
de: Filtern
fr: Filtrer
ja: フィルター
ko: 필터
zh: 筛选

source: Custom Event
de: Benutzerdefiniertes Ereignis
fr: Événement personnalisé
ja: カスタムイベント
ko: 사용자 정의 이벤트
zh: 自定义事件

# specialDaysRangeTitle
source: Special Days Display Range
de: Anzeigebereich für besondere Tage
fr: Plage d'affichage des jours spéciaux
ja: 特別な記念日の表示範囲
ko: 특별한 기념일 표시 범위
zh: 特殊纪念日显示范围

# specialDaysRangeDescription
source: Choose how many days in advance to display special days:
de: Wählen Sie, wie viele Tage im Voraus besondere Tage angezeigt werden sollen:
fr: Sélectionnez combien de jours à l'avance afficher les jours spéciaux :
ja: 特別な記念日を何日前から表示するかを選択してください：
ko: 특별한 기념일을 몇 일 전부터 표시할지 선택하세요:
zh: 选择提前多少天显示特殊纪念日：

# specialDaysRangeSubtitle
source: Show special days {days} days in advance
de: Besondere Tage {days} Tage im Voraus anzeigen
fr: Afficher les jours spéciaux {days} jours à l'avance
ja: 特別な記念日を{days}日前から表示
ko: 특별한 기념일을 {days}일 전부터 표시
zh: 提前{days}天显示特殊纪念日

# daysText
source: days
de: Tage
fr: jours
ja: 日
ko: 일
zh: 天

# holidayManagementTitle
source: Holiday Management
de: Feiertagsverwaltung
fr: Gestion des jours fériés
ja: 祝日管理
ko: 공휴일 관리
zh: 节日管理

# holidayManagementDescription
source: Manage holiday importance and display settings
de: Wichtigkeit und Anzeigeeinstellungen für Feiertage verwalten
fr: Gérer l'importance et les paramètres d'affichage des jours fériés
ja: 祝日の重要度と表示設定を管理する
ko: 공휴일 중요도 및 표시 설정 관리
zh: 管理节日重要性和显示设置

# importanceNormal
source: Normal
ja: 通常
ko: 보통
zh: 普通

# importanceHigh
source: Important
de: Wichtig
ja: 重要
ko: 중요
zh: 重要

# importanceVeryHigh
source: Very Important
de: Sehr wichtig
fr: Très important
ja: 非常に重要
ko: 매우 중요
zh: 非常重要

# exportHolidaysTitle
source: Export Holidays
de: Feiertagsdaten exportieren
fr: Exporter les données des jours fériés
ja: 祝日データをエクスポート
ko: 공휴일 데이터 내보내기
zh: 导出节日数据

# exportSuccess
source: Holidays exported successfully
de: Daten erfolgreich exportiert
fr: Données exportées avec succès
ja: データが正常にエクスポートされました
ko: 데이터가 성공적으로 내보내졌습니다
zh: 节日数据导出成功

# exportError
source: Export error: {error}
de: Fehler beim Exportieren der Daten: {error}
fr: Échec de l'exportation des données : {error}
ja: データのエクスポートに失敗しました: {error}
ko: 데이터 내보내기 실패: {error}
zh: 导出错误: {error}
