Repository: deloog/jinlin
Catalog: lib/l10n/app_localizations_*.arb
Languages: de, fr, ja, ko, zh

# confirmImportTitle
source: Confirm Import
de: Import bestätigen
fr: Confirmer l'importation
ja: インポートの確認
ko: 가져오기 확인
zh: 确认导入

# confirmImportMessage
source: This will import holidays from a file. Existing holidays with the same ID will be overwritten. Continue?
de: Bestehende Daten werden überschrieben. Fortfahren?
fr: Les données existantes seront écrasées. Continuer ?
ja: 既存のデータは上書きされます。続行しますか？
ko: 기존 데이터가 덮어쓰기됩니다. 계속하시겠습니까?
zh: 这将从文件导入节日数据。具有相同ID的现有节日将被覆盖。是否继续？

# importButton
source: Import
de: Importieren
fr: Importer
ja: インポート
ko: 가져오기
zh: 导入

# importSuccess
source: Successfully imported {count} holidays
de: {count} Feiertage importiert
fr: {count} jours fériés importés
ja: {count}件の祝日がインポートされました
ko: {count}개의 공휴일이 가져와졌습니다
zh: 成功导入 {count} 个节日

# importError
source: Import error: {error}
de: Fehler beim Importieren der Daten: {error}
fr: Échec de l'importation des données : {error}
ja: データのインポートに失敗しました: {error}
ko: 데이터 가져오기 실패: {error}
zh: 导入错误: {error}

# dataSyncTitle
source: Data Synchronization
de: Datensynchronisation
fr: Synchronisation des données
ja: データ同期
ko: 데이터 동기화
zh: 数据同步

# exportButton
source: Export
de: Exportieren
fr: Exporter
ja: エクスポート
ko: 내보내기
zh: 导出

# importHolidaysTitle
source: Import Holidays
de: Feiertagsdaten importieren
fr: Importer les données des jours fériés
ja: 祝日データをインポート
ko: 공휴일 데이터 가져오기
zh: 导入节日数据

source: Last export: {time}
de: Letzter Export: {time}
fr: Dernière exportation : {time}
ja: 最終エクスポート: {time}
ko: 마지막 내보내기: {time}
zh: 上次导出时间: {time}

# holidayNameRequired
source: Holiday name is required
de: Bitte geben Sie den Feiertagsnamen ein
fr: Veuillez saisir le nom du jour férié
ja: 祝日名を入力してください
ko: 공휴일 이름을 입력하세요
zh: 节日名称不能为空

# holidayRegionRequired
source: Please select at least one region
de: Bitte wählen Sie mindestens eine Region aus
fr: Veuillez sélectionner au moins une région
ja: 少なくとも1つの地域を選択してください
ko: 최소 하나의 지역을 선택하세요
zh: 请至少选择一个地区

# holidayCalculationRuleRequired
source: Calculation rule is required
de: Bitte geben Sie die Berechnungsregel ein
fr: Veuillez saisir la règle de calcul
ja: 計算ルールを入力してください
ko: 계산 규칙을 입력하세요
zh: 计算规则不能为空

# holidaySaveSuccess
source: Holiday saved successfully
de: Feiertagsinformationen gespeichert
fr: Informations sur le jour férié enregistrées
ja: 祝日情報が保存されました
ko: 공휴일 정보가 저장되었습니다
zh: 节日保存成功

# holidaySaveError
source: Error saving holiday: {error}
de: Fehler beim Speichern der Feiertagsinformationen: {error}
fr: Échec de l'enregistrement des informations sur le jour férié : {error}
ja: 祝日情報の保存に失敗しました: {error}
ko: 공휴일 정보 저장 실패: {error}
zh: 保存节日出错: {error}

# createHolidayTitle
source: Create Holiday
de: Neuen Feiertag erstellen
fr: Créer un nouveau jour férié
ja: 新しい祝日を作成
ko: 새 공휴일 만들기
zh: 创建节日

# holidayIdLabel
source: Holiday ID
de: Feiertags-ID
fr: ID du jour férié
ja: 祝日ID
ko: 공휴일 ID
zh: 节日ID

# holidayTypeLabel
source: Holiday Type
de: Feiertagstyp
fr: Type de jour férié
ja: 祝日タイプ
ko: 공휴일 유형
zh: 节日类型

# holidayRegionsLabel
source: Regions
de: Anwendbare Regionen
fr: Régions applicables
ja: 適用地域
ko: 적용 지역
zh: 适用地区

# holidayCalculationTypeLabel
source: Calculation Type
de: Datumsberechnungstyp
fr: Type de calcul de date
ja: 日付計算タイプ
ko: 날짜 계산 유형
zh: 计算类型

# holidayCalculationRuleLabel
source: Calculation Rule
de: Berechnungsregel
fr: Règle de calcul
ja: 計算ルール
ko: 계산 규칙
zh: 计算规则

# holidayCalculationRuleHint
source: Format depends on calculation type
de: z.B.: MM-TT (festes gregorianisches) oder MM-TTL (festes Mondkalender)
fr: ex. : MM-JJ (grégorien fixe), MM-JJL (lunaire fixe)
ja: 例：MM-DD（固定グレゴリオ暦）、MM-DDL（固定旧暦）
ko: 예: MM-DD (고정 그레고리안), MM-DDL (고정 음력)
zh: 格式取决于计算类型

# holidayImportanceLabel
source: Importance
de: Wichtigkeit
ja: 重要度
ko: 중요도
zh: 重要性

source: Language Settings
ja: 言語設定
ko: 언어 설정
zh: 语言设置

# selectLanguage
source: Select your preferred language
ja: 希望する言語を選択してください
ko: 선호하는 언어를 선택하세요
zh: 选择您偏好的语言

# languageChangeSuccess
source: Language changed successfully
ja: 言語が正常に変更されました
ko: 언어가 성공적으로 변경되었습니다
zh: 语言切换成功

# languageChangeError
source: Failed to change language
ja: 言語の変更に失敗しました
ko: 언어 변경 실패
zh: 语言切换失败

# languageSettingsNote
source: Changing the language will affect all text in the app. Some content may need to reload.
ja: 言語を変更すると、アプリ内のすべてのテキストに影響します。一部のコンテンツは再読み込みが必要な場合があります。
ko: 언어를 변경하면 앱의 모든 텍스트에 영향을 미칩니다. 일부 콘텐츠는 다시 로드해야 할 수 있습니다.
zh: 更改语言将影响应用中的所有文本。某些内容可能需要重新加载。

source: Follow System Language
ja: システム言語に従う
ko: 시스템 언어 따르기
zh: 跟随系统语言

# followSystemLanguageDescription
source: Automatically use the language set in your device settings
ja: デバイス設定で設定された言語を自動的に使用する
ko: 기기 설정에 설정된 언어를 자동으로 사용
zh: 自动使用设备系统设置的语言

# regionChina
source: China
ja: 中国
ko: 중국
zh: 中国

# regionUnitedStates
source: United States
ja: アメリカ合衆国
ko: 미국
zh: 美国

# regionJapan
source: Japan
ja: 日本
ko: 일본
zh: 日本

# regionKorea
source: Korea
ja: 韓国
ko: 한국
zh: 韩国

# regionFrance
source: France
ja: フランス
ko: 프랑스
zh: 法国

# regionGermany
source: Germany
ja: ドイツ
ko: 독일
zh: 德国

# regionInternational
source: International
ja: 国際
ko: 국제
zh: 国际

source: Theme Settings
zh: 主题设置

source: Light Mode
zh: 浅色模式

source: Dark Mode
zh: 深色模式

source: System Mode
zh: 跟随系统

source: Home Layout
zh: 首页布局

source: Card Style
zh: 卡片样式

source: Reminder Priority
zh: 提醒优先级

source: Date Order
zh: 按日期排序

source: Importance Order
zh: 按重要性排序

source: Local Data Sync
zh: 本地数据同步

source: Import/Export holiday data
zh: 导入/导出节日数据

source: Reset Global Holidays
zh: 重置全球节日数据

source: Confirm Reset
zh: 确认重置

# resetGlobalHolidaysConfirm
source: This will reset all global holiday data to default. Are you sure you want to continue?
zh: 这将重置所有全球节日数据到默认状态。您确定要继续吗？

# globalHolidayDataReset
source: Global holiday data has been reset
zh: 全球节日数据已重置

# resetFailed
source: Reset failed: {error}
zh: 重置失败: {error}

# backupFileSubject
source: CetaMind Reminder Backup
zh: 鲸灵提醒备份

# backupSuccessMessage
source: Backup created successfully
zh: 备份创建成功

# backupFailedMessage
source: Failed to create backup
zh: 创建备份失败

# selectBackupFileTitle
source: Select Backup File
zh: 选择备份文件

# restoreConfirmTitle
source: Confirm Restore
zh: 确认恢复

# restoreConfirmMessage
source: This will restore data from backup. Current data may be overwritten. Continue?
zh: 这将从备份中恢复数据。当前数据可能会被覆盖。是否继续？

# restoreButton
source: Restore
zh: 恢复

# restoreSuccessMessage
source: Successfully restored {importedCount} items
zh: 成功恢复 {importedCount} 项

# restoreFailedMessage
source: Failed to restore from backup
zh: 从备份恢复失败

# backupRestoreTitle
source: Backup & Restore
zh: 备份与恢复

# backupTitle
source: Backup Data
zh: 备份数据

# backupDescription
source: Create a backup of your reminders and settings
zh: 创建提醒和设置的备份

source: Last backup: {time}
zh: 上次备份: {time}

# createBackupButton
source: Create Backup
zh: 创建备份

# restoreTitle
source: Restore Data
zh: 恢复数据

# restoreDescription
source: Restore your data from a previous backup
zh: 从之前的备份中恢复数据

# restoreFromBackupButton
source: Restore from Backup
zh: 从备份恢复

# backupRestoreWarning
source: Warning: Backup and restore operations may affect your existing data. Make sure you understand the risks before proceeding.
zh: 警告：备份和恢复操作可能会影响您现有的数据。请确保您了解风险后再继续。

# helpCenterTitle
source: Help Center
zh: 帮助中心

# helpCenterBasicsTitle
source: Basics
zh: 基础知识

# helpCenterBasicsAddTitle
source: Adding Reminders
zh: 添加提醒

# helpCenterBasicsAddDescription
source: Learn how to add new reminders to your timeline
zh: 了解如何在时间线中添加新提醒

# helpCenterBasicsEditTitle
source: Editing Reminders
zh: 编辑提醒

# helpCenterBasicsEditDescription
source: How to edit existing reminders
zh: 如何编辑现有提醒

# helpCenterBasicsDeleteTitle
source: Deleting Reminders
zh: 删除提醒

# helpCenterBasicsDeleteDescription
source: How to remove reminders you no longer need
zh: 如何删除不再需要的提醒

# helpCenterVoiceTitle
source: Voice Features
zh: 语音功能

# helpCenterVoiceInputTitle
source: Voice Input
zh: 语音输入

# helpCenterVoiceInputDescription
source: How to use voice commands to create reminders
zh: 如何使用语音命令创建提醒

# helpCenterVoiceTipsTitle
source: Voice Tips
zh: 语音技巧

# helpCenterVoiceTipsDescription
source: Get the most out of voice recognition
zh: 充分利用语音识别功能

# helpCenterFAQTitle
source: Frequently Asked Questions
zh: 常见问题

# helpCenterFAQ1Question
source: How do I sync my data across devices?
zh: 如何在多个设备间同步数据？

# helpCenterFAQ1Answer
source: Go to Settings > Data Synchronization to set up cloud sync
zh: 前往设置 > 数据同步来设置云同步

# helpCenterFAQ2Question
source: Can I import events from my calendar?
zh: 我可以从日历导入事件吗？

# helpCenterFAQ2Answer
source: Yes, go to Settings > Import/Export Data to import from your calendar
zh: 可以，前往设置 > 导入/导出数据来从日历导入

# helpCenterFAQ3Question
source: How do I customize holiday displays?
zh: 如何自定义节日显示？

# helpCenterFAQ3Answer
source: Go to Settings > Holiday Management to customize which holidays appear
zh: 前往设置 > 节日管理来自定义显示哪些节日

# userGuideTitle
source: Welcome to CetaMind Reminder
zh: 欢迎使用鲸灵提醒

# userGuideSubtitle
source: Let's get you started with a quick tour
zh: 让我们快速了解一下使用方法

# userGuideStep1Title
source: Add Reminders Easily
zh: 轻松添加提醒

# userGuideStep1Description
source: Tap the + button to add new reminders. Use voice or text input for quick entry.
zh: 点击 + 按钮添加新提醒。使用语音或文本输入快速创建。

# userGuideStep2Title
source: Smart Timeline
zh: 智能时间线

# userGuideStep2Description
source: Your timeline shows upcoming reminders and holidays in chronological order.
zh: 您的时间线按时间顺序显示即将到来的提醒和节日。

# userGuideStep3Title
source: AI Assistance
zh: AI 辅助

# userGuideStep3Description
source: Our AI can help generate descriptions, suggest gifts, and provide relevant information.
zh: 我们的 AI 可以帮助生成描述、推荐礼物并提供相关信息。

# userGuideStep4Title
source: Customization
zh: 个性化设置

# userGuideStep4Description
source: Personalize your experience in Settings. Choose themes, languages, and more.
zh: 在设置中个性化您的体验。选择主题、语言等。

# userGuideSkipButton
source: Skip
zh: 跳过

# userGuideShowNextTime
source: Show next time
zh: 下次显示

# userGuideShowAgain
source: Don't show again
zh: 不再显示

# userGuideNextButton
source: Next
zh: 下一步

# userGuideDoneButton
source: Done
zh: 完成

source: Translation almost complete
ja: 翻訳はほぼ完了しています

# translationPartiallyComplete
source: Translation in progress
ja: 翻訳進行中

# translationInProgress
source: Translation incomplete
ja: 翻訳が不完全です
